In [46]:
import pandas as pd

In [47]:
df1 = pd.DataFrame({
    "ID": [1, 2, 3, 5, 9],
    "Col_1": [1, 2, 3, 4, 5],
    "Col_2": [6, 7, 8, 9, 10],
    "Col_3": [11, 12, 13, 14, 15],
    "Col_4": ["apple", "orange", "banana", "strawberry", "raspberry"]
})

df1

   ID  Col_1  Col_2  Col_3       Col_4
0   1      1      6     11       apple
1   2      2      7     12      orange
2   3      3      8     13      banana
3   5      4      9     14  strawberry
4   9      5     10     15   raspberry

In [48]:
df2 = pd.DataFrame({
    "ID": [1, 1, 3, 5],
    "Col_A": [8, 9, 10, 11],
    "Col_B": [12, 13, 15, 17],
    "Col_4": ["apple", "orange", "banana", "kiwi"]
})

df2

   ID  Col_A  Col_B   Col_4
0   1      8     12   apple
1   1      9     13  orange
2   3     10     15  banana
3   5     11     17    kiwi

In [49]:
pd.merge(df1,df2,left_on="Col_2",right_on="Col_B")

Empty DataFrame
Columns: [ID_x, Col_1, Col_2, Col_3, Col_4_x, ID_y, Col_A, Col_B, Col_4_y]
Index: []

In [50]:
inner =pd.merge(df1,df2)
inner
#merging on multiple columns by default

   ID  Col_1  Col_2  Col_3   Col_4  Col_A  Col_B
0   1      1      6     11   apple      8     12
1   3      3      8     13  banana     10     15

### inner merge first looks for common columns(if you dont specify your left_on/right_on),in this case ,ID and Col_4 are common <br>
### then,these columns get used as keys <br>
### what it then does ,look through all records/rows in each dataframe ,if the value in ID:df1 matches ID:df2 <b>AND</b> Col_4:df1 matches Col_4:df2 <br>
### it keeps those records/rows and merges them together (big keyword here is <b>AND</b>)


# inner merges work something like AND gate logic ,where both records need to match to be added(ALL conditions must be true)

# The positiong of where <b>df1 and df2 </b> are ,are important when dealing with other joins  </br>
## lets first understand what left and right are

In [51]:
left=pd.merge(df1,df2,how="left")
left

   ID  Col_1  Col_2  Col_3       Col_4  Col_A  Col_B
0   1      1      6     11       apple    8.0   12.0
1   2      2      7     12      orange    NaN    NaN
2   3      3      8     13      banana   10.0   15.0
3   5      4      9     14  strawberry    NaN    NaN
4   9      5     10     15   raspberry    NaN    NaN

### left join is ,taking all the records from the table on the left which in this case is df1 ,then matching those with the records on the right which is df2<br>
### so we keep everything from df1,and only records from df2 that match the ones from df1 ,and if they dont match we get NAN<br>
### if df1 and df2 were swapped youd get different results,meaning df2 is our left table and df1 is our right table

In [52]:
right=pd.merge(df1,df2,how="right")
right

   ID  Col_1  Col_2  Col_3   Col_4  Col_A  Col_B
0   1    1.0    6.0   11.0   apple      8     12
1   1    NaN    NaN    NaN  orange      9     13
2   3    3.0    8.0   13.0  banana     10     15
3   5    NaN    NaN    NaN    kiwi     11     17

### right join bascially just invereses our left join <br>
### we are keeping everything from df2 and the matching records from df1 ,non matching columns == NAN

In [53]:
outer=pd.merge(df1,df2,how="outer")
outer

   ID  Col_1  Col_2  Col_3       Col_4  Col_A  Col_B
0   1    1.0    6.0   11.0       apple    8.0   12.0
1   1    NaN    NaN    NaN      orange    9.0   13.0
2   2    2.0    7.0   12.0      orange    NaN    NaN
3   3    3.0    8.0   13.0      banana   10.0   15.0
4   5    NaN    NaN    NaN        kiwi   11.0   17.0
5   5    4.0    9.0   14.0  strawberry    NaN    NaN
6   9    5.0   10.0   15.0   raspberry    NaN    NaN

# Outer join just combines everything together ,whether there are matched records or not ,columns that dont match == NAN

### One thing to take note of is ,if you specfiy the columns to merge on with an inner ,if those columns dont have any matching records ,youll get nothing <br>
## Remeber the <b>AND</b> gate logic when working with inner merge/join

In [54]:
nothing_merge=pd.merge(df1,df2,left_on="Col_1",right_on="Col_B",how="inner")
nothing_merge

Empty DataFrame
Columns: [ID_x, Col_1, Col_2, Col_3, Col_4_x, ID_y, Col_A, Col_B, Col_4_y]
Index: []